{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"homePlayers","class_name":"InputLayer","config":{"batch_input_shape":[null,22],"dtype":"int32","sparse":false,"name":"homePlayers"},"inbound_nodes":[]},{"name":"homeForm","class_name":"InputLayer","config":{"batch_input_shape":[null,22],"dtype":"float32","sparse":false,"name":"homeForm"},"inbound_nodes":[]},{"name":"awayPlayers","class_name":"InputLayer","config":{"batch_input_shape":[null,22],"dtype":"int32","sparse":false,"name":"awayPlayers"},"inbound_nodes":[]},{"name":"awayForm","class_name":"InputLayer","config":{"batch_input_shape":[null,22],"dtype":"float32","sparse":false,"name":"awayForm"},"inbound_nodes":[]},{"name":"homeTeam","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"homeTeam"},"inbound_nodes":[]},{"name":"awayTeam","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"awayTeam"},"inbound_nodes":[]},{"name":"playerEmbedding","class_name":"Embedding","config":{"input_dim":405,"output_dim":64,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"playerEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["homePlayers",0,0,{}]],[["awayPlayers",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[22,1],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["homeForm",0,0,{}]]]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[22,1],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["awayForm",0,0,{}]]]},{"name":"teamEmbedding","class_name":"Embedding","config":{"input_dim":21,"output_dim":32,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"teamEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["homeTeam",0,0,{}]],[["awayTeam",0,0,{}]]]},{"name":"multiply_Multiply1","class_name":"Multiply","config":{"name":"multiply_Multiply1","trainable":true},"inbound_nodes":[[["playerEmbedding",0,0,{}],["reshape_Reshape1",0,0,{}]]]},{"name":"multiply_Multiply2","class_name":"Multiply","config":{"name":"multiply_Multiply2","trainable":true},"inbound_nodes":[[["playerEmbedding",1,0,{}],["reshape_Reshape2",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["teamEmbedding",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["teamEmbedding",1,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["multiply_Multiply1",0,0,{}]]]},{"name":"flatten_Flatten4","class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true},"inbound_nodes":[[["multiply_Multiply2",0,0,{}]]]},{"name":"h2hStats","class_name":"InputLayer","config":{"batch_input_shape":[null,6],"dtype":"float32","sparse":false,"name":"h2hStats"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}],["flatten_Flatten3",0,0,{}],["flatten_Flatten4",0,0,{}],["h2hStats",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}],["dropout_Dropout2",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":405,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":6,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"scoreOutput","class_name":"Dense","config":{"units":2,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"scoreOutput","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"scorerOutput","class_name":"Activation","config":{"activation":"sigmoid","name":"scorerOutput","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]},{"name":"timeOutput","class_name":"Activation","config":{"activation":"softmax","name":"timeOutput","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]}],"input_layers":[["homeTeam",0,0],["awayTeam",0,0],["homePlayers",0,0],["awayPlayers",0,0],["homeForm",0,0],["awayForm",0,0],["h2hStats",0,0]],"output_layers":[["scoreOutput",0,0],["scorerOutput",0,0],["timeOutput",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"playerEmbedding/embeddings","shape":[405,64],"dtype":"float32"},{"name":"teamEmbedding/embeddings","shape":[21,32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[2886,512],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[512,256],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[2886,256],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[256,405],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[405],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[256,6],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[6],"dtype":"float32"},{"name":"scoreOutput/kernel","shape":[256,2],"dtype":"float32"},{"name":"scoreOutput/bias","shape":[2],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}